Tekla.Structures.Drawing.PrintAttributes
The PrintAttributes class contains the attributes for controlling the printing.

Tekla.Structures.Drawing.PrintAttributes.PrinterInstance
The name of the printer instance.
Can be fetched from the printer catalog.

Tekla.Structures.Drawing.PrintAttributes.ScalingType
The scale type.

Tekla.Structures.Drawing.PrintAttributes.Scale
The scale factor.

Tekla.Structures.Drawing.PrintAttributes.PrintToMultipleSheet
Whether to print to multiple sheets.

Tekla.Structures.Drawing.PrintAttributes.NumberOfCopies
The number of copies in printing.

Tekla.Structures.Drawing.PrintAttributes.Orientation
The print orientation type.

Tekla.Structures.Drawing.PrintAttributes.PrintArea
The print area type.

Tekla.Structures.Drawing.PrintAttributes.#ctor
Creates a new PrintAttributes instance.

Tekla.Structures.Drawing.PrintAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.